app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["address", ""], ["created_at", "2022-06-06 12:37:03.522756"], ["updated_at", "2022-06-06 12:37:03.522756"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "updated_at" = ? WHERE "authors"."id" = ?  [["updated_at", "2022-06-07 04:37:02.529150"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)