app/controllers/books_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."name" = ? ORDER BY "authors"."id" ASC LIMIT ?  [["name", "dsa"], ["LIMIT", 1]]
INSERT INTO "books" ("name", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?)  [["name", "[\"asd\"]"], ["created_at", "2022-06-10 10:04:19.833907"], ["updated_at", "2022-06-10 10:04:19.833907"], ["author_id", 1]]
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2022-06-10 10:11:24.641281"], ["id", 3]]
---
  def create
    # @book = Book.new( name: book_params[:name] )
    author_temp = Author.where( name: [book_params[:authors_id]] ).first()

    @book = author_temp.books.create( name: book_params[:name], cover_photos: book_params[:cover_photos] )
    puts @book.inspect
    respond_to do |format|
      if @book.save